**18.7.24**

In [1]:
======================================EDA============================
1)pandas                :dataframe or data application
2)numpy                 :numerical python for math operation
3)matplotlib            :for plots graphs
4)seaborn               :for plot graphs
5)bokhe                 :for plots
6)plotly                :for plots

==========================Machine learnig==============================
7)scikit learn(Sklearn) : ML models
8)stats                 : statistical models


==========================Data retrival from sql scrapping=============
9)sqlite                :connect with databse
10)Beautiful soup       :scrap the data from website
11)websocket            :scrap


=======================Deep learning/computer vision====================================
12)Tensorflow           :google
13)keras                :DL models
14)OpenCV               :Image operations
15)Pillow(PILL)         :Image operations
16)Pytorch              :facebook
17)Pretrained models
    VGG16
    Mobilenet
    RESNET
    RCNN
    MASKRCNN
    FASTERCNN
    YOLO
======================Natual language process==================================
18)NLTK                 :natural language process
19)Scipy
20)Word2vec(How words will convert into vectors)
21)GloVE
22)Wordcloud

======================Hugging face=============================================
23)Transformers         :BERT

======================GenAI models==================================================
24)OpenAI+Microsoft:GPT models
25)google          :gemini
26)amazon          :Q
27)Meta Facebook   :Meta AI
28)Apple


LLAMA
GEMMA
Dalle-E
T5
ALL ARE HAVING DIFFERENT DIFFERENT PACKAGES


=====================LANGCHAIN==============================
It is a framework which is used for gen ai model
29)LangChain Framework

=====================Deployments/applications================
30)Flask
31)Streamlit
32)Django


====================MLops=======================================
33)Mlflow
34)Kubeflow
35)Azure Ai services  :azure packages
36)GCP                :GCP packages

SyntaxError: unmatched ')' (3730671548.py, line 2)

**Step-1**

**Create DataFRAME**

- We will create a dataframe using list

- we will create a dataframe using dictionary

In [9]:
import pandas as pd

In [ ]:
d1=pd.DataFrame()
d1

In [ ]:
type(d1)

**Step-2**

**provide the data**

In [22]:
names=['ak','deba','subha']
pd.DataFrame(names)

       0
0     ak
1   deba
2  subha

In [24]:
names=['ak','deba','subha']
age=[20,25,30]
pd.DataFrame(zip(names,age))

       0   1
0     ak  20
1   deba  25
2  subha  30

In [26]:
names=['ak','deba','subha']
age=[20,25,30]
city=['bam','bbsr','ctc']
pd.DataFrame(zip(names,age,city))

       0   1     2
0     ak  20   bam
1   deba  25  bbsr
2  subha  30   ctc

**step-3**

**provide the column names**

In [13]:
names=['ak','deba','subha']
pd.DataFrame(names,columns=['Names'])

   Names
0     ak
1   deba
2  subha

In [11]:
names=['ak','deba','subha']
age=[20,25,30]
pd.DataFrame(zip(names,age),columns=['Names','Age'])

   Names  Age
0     ak   20
1   deba   25
2  subha   30

In [15]:
names=['ak','deba','subha']
age=[20,25,30]
city=['bam','bbsr','ctc']

pd.DataFrame(zip(names,age,city),columns=['Names','Age','City'])

   Names  Age  City
0     ak   20   bam
1   deba   25  bbsr
2  subha   30   ctc

**step-4**

**providing index**

In [17]:
names=['ak','deba','subha']
age=[20,25,30]
city=['bam','bbsr','ctc']

pd.DataFrame(zip(names,age,city),index=['a','b','c'],columns=['Names','Age','City'])

   Names  Age  City
a     ak   20   bam
b   deba   25  bbsr
c  subha   30   ctc

In [19]:
names=['ak','deba','subha']
age=[20,25,30]
city=['bam','bbsr','ctc']

cols=['Names','Age']
pd.DataFrame(zip(names,age),index=city,columns=cols)

      Names  Age
bam      ak   20
bbsr   deba   25
ctc   subha   30